backend/tests/load/load-courses.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 15
      name: "Carga Constante"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "LOAD-CRS-01: Alta concurrencia consultando catalogo"
    weight: 5
    flow:
      - get:
          url: "/api/v1/courses"
          expect:
            - statusCode: 200

  - name: "LOAD-CRS-02: Alta concurrencia de creacion de cursos"
    weight: 1
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "jedi@nexus.test"
            contrasena: "Test1234!"
          capture:
            - json: "$.data.token"
              as: "token"
      - post:
          url: "/api/v1/courses"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            titulo: "Load Test Course {{ $randomNumber(1, 1000) }}"
            descripcion: "Creado bajo carga"

  - name: "LOAD-CRS-03: Consulta paralela de Mis Cursos"
    weight: 3
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "padawan@nexus.test"
            contrasena: "Test1234!"
          capture:
            - json: "$.data.token"
              as: "token"
      - get:
          url: "/api/v1/courses/mine"
          headers:
            Authorization: "Bearer {{ token }}"