backend/tests/load/load-extra.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 10
      name: "Carga sostenida"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Scenario 1"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 2"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 3"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 4"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 5"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 6"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 7"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 8"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 9"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 10"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 11"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 12"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 13"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 14"
    flow:
      - get:
          url: "/api/v1/health"
  - name: "Scenario 15"
    flow:
      - get:
          url: "/api/v1/health"